andreili/STM32FX_FM/src/stm32_hcd.cpp
#include "stm32_hcd.h"

#ifdef STM32_USE_USB_HOST

uint32_t STM32_HCD::init(USB_OTG_GlobalTypeDef* regs_addr, EOTG_PHY phy, bool use_ext_vbus, bool dma_enable,
                         EOTGSpeed speed, uint8_t host_channels)
{
    debug_fn();
    m_state = EHCDState::BUSY;
    m_regs = reinterpret_cast<OTGRegs_t*>(regs_addr);
    m_dma_enable = dma_enable;
    m_host_channels = host_channels;
    m_phy = phy;
    m_speed = speed;

    init_gpio();
    disable();
    if (core_init(use_ext_vbus) != STM32_RESULT_OK)
        return STM32_RESULT_FAIL;
    set_current_mode(EOTGDeviceMode::HOST);
    host_init();
    m_state = EHCDState::READY;
    return STM32_RESULT_OK;
}

void STM32_HCD::deInit()
{
    debug_fn();
    m_state = EHCDState::BUSY;
    deInit_gpio();
    disable();
    m_state = EHCDState::RESET_;
}

void STM32_HCD::set_toggle(uint8_t pipe, uint8_t toggle)
{
    debug_fn();
    if (m_HC[pipe].ep_is_in)
        m_HC[pipe].toggle_in = toggle;
    else
        m_HC[pipe].toggle_out = toggle;
}

uint8_t STM32_HCD::get_toggle(uint8_t pipe)
{
    debug_fn();
    if (m_HC[pipe].ep_is_in)
        return m_HC[pipe].toggle_in;
    else
        return m_HC[pipe].toggle_out;
}

void STM32_HCD::reset_port()
{
    debug_fn();
    uint32_t val = m_regs->ports[0];
    val &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);
    reset_port_st1(USB_OTG_HPRT_PRST | val);
    STM32_SYSTICK::delay(10);
    reset_port_st1((~USB_OTG_HPRT_PRST) & val);
}

uint32_t STM32_HCD::start()
{
    debug_fn();
    STM32_LOCK(m_lock);
    enable();
    drive_VBUS(SET);
    STM32_UNLOCK(m_lock);
    return STM32_RESULT_OK;
}

uint32_t STM32_HCD::stop()
{
    debug_fn();
    STM32_LOCK(m_lock);
    stop_host();
    STM32_UNLOCK(m_lock);
    return STM32_RESULT_OK;
}

uint32_t STM32_HCD::HC_init(uint8_t ch_num, uint8_t ep_num, uint8_t dev_address, EOTGSpeed speed, EEPType ep_type, uint16_t mps)
{
    debug_fn();
    STM32_LOCK(m_lock);

    m_HC[ch_num].dev_addr = dev_address;
    m_HC[ch_num].max_packet = mps;
    m_HC[ch_num].ch_num = ch_num;
    m_HC[ch_num].ep_type = ep_type;
    m_HC[ch_num].ep_num = ep_num & 0x7f;
    m_HC[ch_num].ep_is_in = ((ep_num & 0x80) == 0x80);
    m_HC[ch_num].speed = speed;

    clear_HC_int(ch_num, 0xffffffff);
    switch (ep_type)
    {
    case EEPType::CTRL:
    case EEPType::BULK:
        set_HC_int(ch_num, USB_OTG_HCINTMSK_XFRCM  |
                   USB_OTG_HCINTMSK_STALLM |
                   USB_OTG_HCINTMSK_TXERRM |
                   USB_OTG_HCINTMSK_DTERRM |
                   USB_OTG_HCINTMSK_AHBERR |
                   USB_OTG_HCINTMSK_NAKM);
        if (ep_num & 0x80)
            unmask_HC_int(ch_num, USB_OTG_HCINTMSK_BBERRM);
        else if (m_regs != reinterpret_cast<OTGRegs_t*>(USB_OTG_FS))
            unmask_HC_int(ch_num, USB_OTG_HCINTMSK_NYET | USB_OTG_HCINTMSK_ACKM);
        break;
    case EEPType::INTR:
        set_HC_int(ch_num, USB_OTG_HCINTMSK_XFRCM  |
                   USB_OTG_HCINTMSK_STALLM |
                   USB_OTG_HCINTMSK_TXERRM |
                   USB_OTG_HCINTMSK_DTERRM |
                   USB_OTG_HCINTMSK_NAKM   |
                   USB_OTG_HCINTMSK_AHBERR |
                   USB_OTG_HCINTMSK_FRMORM);
        if (ep_num & 0x80)
            unmask_HC_int(ch_num, USB_OTG_HCINTMSK_BBERRM);
        break;
    case EEPType::ISOC:
        set_HC_int(ch_num, USB_OTG_HCINTMSK_XFRCM  |
                   USB_OTG_HCINTMSK_ACKM   |
                   USB_OTG_HCINTMSK_AHBERR |
                   USB_OTG_HCINTMSK_FRMORM);
        if (ep_num & 0x80)
            unmask_HC_int(ch_num, USB_OTG_HCINTMSK_TXERRM | USB_OTG_HCINTMSK_BBERRM);
        break;
    case EEPType::MSK:
        break;
    }
    enable_host_IT(ch_num);
    enable_IT(USB_OTG_GINTMSK_HCIM);
    HC_set_params(ch_num, ep_num, dev_address, speed, ep_type, mps);
    if (ep_type == EEPType::INTR)
        HC_enable_param(ch_num, USB_OTG_HCCHAR_ODDFRM);

    STM32_UNLOCK(m_lock);
    return STM32_RESULT_OK;
}

void STM32_HCD::HC_submit_request(uint8_t ch_num, bool is_in, EEPType ep_type, bool token, uint8_t* pbuff, uint16_t length, bool do_ping)
{
    debug_fn();
    m_HC[ch_num].ep_is_in = is_in;
    m_HC[ch_num].ep_type = ep_type;

    if (!token)
        m_HC[ch_num].data_pid = EPID::SETUP;
    else
        m_HC[ch_num].data_pid = EPID::DATA1;

    switch (ep_type)
    {
    case EEPType::CTRL:
        if (token && (!is_in)) /*send data */
        {
            if (length == 0)
                m_HC[ch_num].toggle_out = true;
            if (!m_HC[ch_num].toggle_out)
                m_HC[ch_num].data_pid = EPID::DATA0;
            else
                m_HC[ch_num].data_pid = EPID::DATA1;
            if (m_HC[ch_num].urb_state != EURBState::NOT_READY)
                m_HC[ch_num].do_ping = do_ping;
        }
        break;
    case EEPType::BULK:
        if (!is_in)
        {
            if (!m_HC[ch_num].toggle_out)
                m_HC[ch_num].data_pid = EPID::DATA0;
            else
                m_HC[ch_num].data_pid = EPID::DATA1;
            if (m_HC[ch_num].urb_state != EURBState::NOT_READY)
                m_HC[ch_num].do_ping = do_ping;
        }
        else
        {
            if (!m_HC[ch_num].toggle_in)
                m_HC[ch_num].data_pid = EPID::DATA0;
            else
                m_HC[ch_num].data_pid = EPID::DATA1;
        }
        break;
    case EEPType::INTR:
        if (!is_in)
        {
            if (!m_HC[ch_num].toggle_out)
                m_HC[ch_num].data_pid = EPID::DATA0;
            else
                m_HC[ch_num].data_pid = EPID::DATA1;
        }
        else
        {
            if (!m_HC[ch_num].toggle_in)
                m_HC[ch_num].data_pid = EPID::DATA0;
            else
                m_HC[ch_num].data_pid = EPID::DATA1;
        }
        break;
    case EEPType::ISOC:
        m_HC[ch_num].data_pid = EPID::DATA0;
        break;
    case EEPType::MSK:
        break;
    }

    m_HC[ch_num].xfer_buff = pbuff;
    m_HC[ch_num].xfer_len = length;
    m_HC[ch_num].urb_state = EURBState::IDLE;
    m_HC[ch_num].xfer_count = 0;
    m_HC[ch_num].ch_num = ch_num;
    m_HC[ch_num].state = EHCState::IDLE;
    HC_start_Xfer(&m_HC[ch_num], m_dma_enable);
}

