andreili/STM32FX_FM/src/stm32_hcd.cpp
uint32_t STM32_HCD::HC_halt(uint8_t hc_num)
{
    debug_fn();
    STM32_LOCK(m_lock);

    uint32_t FIFO_queue = 0;
    uint32_t val = HC_get_params(hc_num);
    if (((val & USB_OTG_HCCHAR_EPTYP) == HCCHAR_CTRL) ||
        ((val & USB_OTG_HCCHAR_EPTYP) == HCCHAR_BULK))
        FIFO_queue = get_TX_NP_FIFO_hi_size();
    else
        FIFO_queue = get_TX_P_FIFO_size();

    HC_enable_param(hc_num, USB_OTG_HCCHAR_CHDIS);
    if (FIFO_queue == 0)
    {
        HC_disable_param(hc_num, USB_OTG_HCCHAR_CHENA);
        HC_enable_param(hc_num, USB_OTG_HCCHAR_CHENA);
        uint32_t count = 0;
        do
        {
            if (++count > 1000)
                break;
        } while ((HC_get_params(hc_num) & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
    }
    else
        HC_enable_param(hc_num, USB_OTG_HCCHAR_CHENA);

    STM32_UNLOCK(m_lock);
    return STM32_RESULT_OK;
}

void STM32_HCD::IRQ_handler()
{
    if (get_mode() == EOTGDeviceMode::HOST)
    {
        if (is_invalid_IT())
            return;

        uint32_t IT = read_IT();
        uint32_t clr_msk = 0;
        if (IT & USB_OTG_GINTSTS_PXFR_INCOMPISOOUT)
            clr_msk |= USB_OTG_GINTSTS_PXFR_INCOMPISOOUT;
        if (IT & USB_OTG_GINTSTS_IISOIXFR)
            clr_msk |= USB_OTG_GINTSTS_IISOIXFR;
        if (IT & USB_OTG_GINTSTS_PTXFE)
            clr_msk |= USB_OTG_GINTSTS_PTXFE;
        if (IT & USB_OTG_GINTSTS_MMIS)
            clr_msk |= USB_OTG_GINTSTS_MMIS;
        if (IT & USB_OTG_GINTSTS_DISCINT)
        {
            m_regs->ports[0] &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);
            disconnect_callback(this);
            init_FSLSPClk_sel(EClockSpeed::_48_MHZ);
            clr_msk |= USB_OTG_GINTSTS_DISCINT;
        }
        if (IT & USB_OTG_GINTSTS_HPRTINT)
            port_IRQ_handler();
        if (IT & USB_OTG_GINTSTS_SOF)
        {
            SOF_callback(this);
            clr_msk |= USB_OTG_GINTSTS_SOF;
        }
        if (IT & USB_OTG_GINTSTS_HCINT)
        {
            uint32_t it = HC_read_IT();
            for (uint8_t i=0 ; i<m_host_channels ; ++i)
            {
                if (it & (1 << i))
                {
                    if (HC_get_dir(i))
                        HC_in_IRQ_handler(i);
                    else
                        HC_out_IRQ_handler(i);
                }
            }
            clr_msk |= USB_OTG_GINTSTS_HCINT;
        }
        if (IT & USB_OTG_GINTSTS_RXFLVL)
        {
            mask_IT(USB_OTG_GINTSTS_RXFLVL);
            RXQLVL_IRQ_handler();
            unmask_IT(USB_OTG_GINTSTS_RXFLVL);
        }
        clear_flag(clr_msk);
    }
}

void STM32_HCD::init_gpio()
{
    debug_fn();
    if (m_regs == reinterpret_cast<OTGRegs_t*>(USB_OTG_FS))
    {
        STM32_USB_FS_PORT.set_config(STM32_USB_FS_DM_PIN | STM32_USB_FS_DP_PIN, STM32_GPIO::EMode::AF_PP,
                                     GPIO_AF10_OTG_FS, STM32_GPIO::ESpeed::VERY_HIGH, STM32_GPIO::EPull::NOPULL);
        STM32_RCC::STM32_USB_FS_EN_CLK();
        STM32_RCC::enable_clk_USB_FS();
        STM32_NVIC::enable_and_set_prior_IRQ(OTG_FS_IRQn, 0, 0);
        STM32_USB_PWR_FS_PORT.set_config(STM32_USB_PWR_FS_PIN, STM32_GPIO::EMode::OUTPUT_PP,
                                         0, STM32_GPIO::ESpeed::LOW, STM32_GPIO::EPull::NOPULL);
    }
    else
    {
        STM32_USB_HS_PORT.set_config(STM32_USB_HS_DM_PIN | STM32_USB_HS_DP_PIN, STM32_GPIO::EMode::AF_PP,
                                     GPIO_AF12_OTG_HS_FS, STM32_GPIO::ESpeed::VERY_HIGH, STM32_GPIO::EPull::NOPULL);
        STM32_RCC::STM32_USB_HS_EN_CLK();
        STM32_RCC::enable_clk_USB_HS();
        STM32_NVIC::enable_and_set_prior_IRQ(OTG_HS_IRQn, 0, 0);
        STM32_USB_PWR_HS_PORT.set_config(STM32_USB_PWR_HS_PIN, STM32_GPIO::EMode::OUTPUT_PP,
                                         0, STM32_GPIO::ESpeed::LOW, STM32_GPIO::EPull::NOPULL);
    }
}

void STM32_HCD::deInit_gpio()
{
    debug_fn();
    if (m_regs == reinterpret_cast<OTGRegs_t*>(USB_OTG_FS))
    {
        STM32_RCC::disable_clk_OTGFS();
        STM32_USB_FS_PORT.unset_config(STM32_USB_FS_DM_PIN | STM32_USB_FS_DP_PIN);
        STM32_NVIC::disable_IRQ(OTG_FS_IRQn);
    }
    else
    {
        STM32_RCC::disable_clk_OTGHS();
        STM32_USB_HS_PORT.unset_config(STM32_USB_HS_DM_PIN | STM32_USB_HS_DP_PIN);
        STM32_NVIC::disable_IRQ(OTG_HS_IRQn);
    }
}

uint32_t STM32_HCD::core_init(bool use_ext_vbus)
{
    debug_fn();
    if (m_phy == EOTG_PHY::ULPI)
    {
        power_down();
        init_phy_ULPI();
        reset_ULPI_VBUS();
        if (use_ext_vbus)
            set_ULPI_VBUS();
        if (core_reset() != STM32_RESULT_OK)
            return STM32_RESULT_FAIL;
    }
    else
    {
        init_phy_embedded();
        if (core_reset() != STM32_RESULT_OK)
            return STM32_RESULT_FAIL;
        power_up();
    }
    if (m_dma_enable)
        enable_DMA();
    return STM32_RESULT_OK;
}

void STM32_HCD::dev_init(bool vbus_sending_enable, uint32_t ep_count, bool sof_enable)
{
    debug_fn();
    if (!vbus_sending_enable)
        disable_VBUS();
    else
        enable_VBUS_B();
    restart_phy_clock();
    mode_device_configuration();
    if (m_phy == EOTG_PHY::ULPI)
    {
        if (m_speed == EOTGSpeed::HIGH)
            set_dev_speed(EOTGSpeed::HIGH);
        else
            set_dev_speed(EOTGSpeed::HIGH_IN_FULL);
    }
    else
        set_dev_speed(EOTGSpeed::FULL);
    flush_TX_FIFO(TX_FIFO_COUNT);
    flush_RX_FIFO();
    clear_all_ITs();
    for (uint32_t i=0 ; i<ep_count ; ++i)
    {
        if (is_in_endpoint_enable(i))
            disable_NAK_in_endpoint(i);
        else
            disable_in_endpoint(i);
        in_endpoint_reset_Xfer_size(i);
        in_endpoint_reset_IT(i);
    }
    for (uint32_t i=0 ; i<ep_count ; ++i)
    {
        if (is_out_endpoint_enable(i))
            disable_NAK_out_endpoint(i);
        else
            disable_out_endpoint(i);
        out_endpoint_reset_Xfer_size(i);
        out_endpoint_reset_IT(i);
    }

    reset_FIFO_underrun_flag();

