andreili/STM32FX_FM/src/stm32_hcd.cpp
    if (m_dma_enable)
        set_DMA_thresshold();

    disable_all_IT();
    clear_all_IT();

    if (!m_dma_enable)
        enable_IT(USB_OTG_GINTMSK_RXFLVLM);

    enable_IT(USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_USBRST |
              USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_IEPINT |
              USB_OTG_GINTMSK_OEPINT   | USB_OTG_GINTMSK_IISOIXFRM|
              USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM);

    if (sof_enable)
        enable_IT(USB_OTG_GINTMSK_SOFM);

    if (vbus_sending_enable)
        enable_IT(USB_OTG_GINTMSK_SRQIM | USB_OTG_GINTMSK_OTGINT);
}

void STM32_HCD::set_current_mode(EOTGDeviceMode mode)
{
    debug_fn();
    reset_mode();
    if (mode == EOTGDeviceMode::HOST)
        set_mode_host();
    else if (mode == EOTGDeviceMode::DEVICE)
        set_mode_device();
    STM32_SYSTICK::delay(500);
}

STM32_HCD::EOTGSpeed STM32_HCD::get_dev_speed()
{
    debug_fn();
    uint32_t speed = get_dev_speed_RAW();
    switch (speed)
    {
    case DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ:
        return EOTGSpeed::HIGH;
    case DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ:
    case DSTS_ENUMSPD_FS_PHY_48MHZ:
        return EOTGSpeed::FULL;
    case DSTS_ENUMSPD_LS_PHY_6MHZ:
    default:
        return EOTGSpeed::LOW;
    }
}

uint32_t STM32_HCD::flush_RX_FIFO()
{
    debug_fn();
    m_regs->global.GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
    uint32_t count = 0;
    do
    {
        if (++count > 200*1000)
            return STM32_RESULT_TIMEOUT;
    } while ((m_regs->global.GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);
    return STM32_RESULT_OK;
}

uint32_t STM32_HCD::flush_TX_FIFO(uint32_t num)
{
    debug_fn();
    m_regs->global.GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (num << USB_OTG_GRSTCTL_TXFNUM_Pos);
    uint32_t count = 0;
    do
    {
        if (++count > 200*1000)
            return STM32_RESULT_TIMEOUT;
    } while ((m_regs->global.GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);
    return STM32_RESULT_OK;
}

void STM32_HCD::activate_endpoint(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket, uint8_t ep_type)
{
    debug_fn();
    if (ep_is_in)
    {
        set_ep_IT_mask(USB_OTG_DAINTMSK_IEPM & (1 << ep_num));
        if (!is_ep_in_active(ep_num))
            activate_ep_in(ep_num, ep_maxpacket, ep_type);
    }
    else
    {
        set_ep_IT_mask(USB_OTG_DAINTMSK_OEPM & ((1 << ep_num) << USB_OTG_DAINTMSK_OEPM_Pos));
        if (!is_ep_out_active(ep_num))
            activate_ep_out(0, ep_maxpacket, ep_type);
    }
}

uint32_t STM32_HCD::deactivate_endpoint(bool ep_is_in, uint8_t ep_num)
{
    debug_fn();
    if (ep_is_in)
    {
        deactivate_ep_in(ep_num);
        set_NAK_ep_in(ep_num);
        disable_ep_in(ep_num);
        uint32_t count = 0;
        do
        {
            if (++count > 200*1000)
                return STM32_RESULT_TIMEOUT;
        } while (is_ep_in_disabled(ep_num));

        flush_TX_FIFO(TX_FIFO_COUNT);
        clear_ep_IT_mask(USB_OTG_DAINTMSK_IEPM & (1 << ep_num));
    }
    else
    {
        deactivate_ep_out(ep_num);
        set_NAK_ep_out(ep_num);
        disable_ep_out(ep_num);
        uint32_t count = 0;
        do
        {
            if (++count > 200*1000)
                return STM32_RESULT_TIMEOUT;
        } while (is_ep_out_disabled(ep_num));

        clear_global_NAK();
        clear_ep_IT_mask(USB_OTG_DAINTMSK_OEPM & ((1 << ep_num) << USB_OTG_DAINTMSK_OEPM_Pos));
    }
    return STM32_RESULT_OK;
}

void STM32_HCD::activate_dedicated_endpoint(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket, uint8_t ep_type)
{
    debug_fn();
    if (ep_is_in)
    {
        if (!is_ep_in_active(ep_num))
            activate_ep_in(ep_num, ep_maxpacket, ep_type);
        set_ded_ep_IT_mask(USB_OTG_DAINTMSK_IEPM & (1 << ep_num));
    }
    else
    {
        if (!is_ep_out_active(ep_num))
            activate_ep_out(ep_num, ep_maxpacket, ep_type);
        set_ded_ep_IT_mask(USB_OTG_DAINTMSK_OEPM & ((1 << ep_num) << USB_OTG_DAINTMSK_OEPM_Pos));
    }
}

void STM32_HCD::EP_start_Xfer(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket,
                              uint8_t* xfer_buff, uint16_t xfer_len, EEPType ep_type,
                              bool dma, uint32_t dma_addr)
{
    debug_fn();
    if (ep_is_in)
    {
        if (xfer_len == 0)
        {
            Xfer_in_pkt_start(ep_num);
            Xfer_in_pkt_size(ep_num, 1);
        }
        else
        {
            Xfer_in_pkt_start(ep_num);
            Xfer_in_pkt_size(ep_num, (xfer_len + ep_maxpacket - 1) / ep_maxpacket);
            Xfer_in_pkt_end(ep_num, xfer_len);

            if (ep_type == EEPType::ISOC)
                Xfer_in_pkt_multi(ep_num);
        }
        if (dma)
            Xfer_in_enable_DMA(ep_num, dma_addr);
        else if ((ep_type != EEPType::ISOC) && (xfer_len > 0))
            set_dev_empty_mask(ep_num);
        if (ep_type == EEPType::ISOC)
        {
            if (is_frame_odd())
                Xfer_in_set_odd_frame(ep_num);
            else
                Xfer_in_set_data0_pid(ep_num);
        }
        Xfer_in_ep_enable(ep_num);
        if (ep_type == EEPType::ISOC)
            write_packet(xfer_buff, ep_num, xfer_len, dma);
    }
    else
    {
        Xfer_out_pkt_start(ep_num);
        if (xfer_len == 0)
        {
            Xfer_out_pkt_size(ep_num, 1);
            Xfer_out_pkt_end(ep_num, ep_maxpacket);
        }
        else
        {
            uint16_t pkt_cnt = static_cast<uint16_t>((xfer_len + ep_maxpacket - 1) / ep_maxpacket);
            Xfer_out_pkt_size(ep_num, pkt_cnt);
            Xfer_out_pkt_end(ep_num, ep_maxpacket * pkt_cnt);
        }
        if (dma)
            Xfer_out_enable_DMA(ep_num, reinterpret_cast<uint32_t>(xfer_buff));
        if (ep_type == EEPType::ISOC)
        {
            if (is_frame_odd())
                Xfer_out_set_odd_frame(ep_num);
            else
                Xfer_out_set_data0_pid(ep_num);
        }
        Xfer_out_ep_enable(ep_num);
    }
}

void STM32_HCD::EP0_start_Xfer(bool ep_is_in, uint8_t ep_num, uint16_t ep_maxpacket,
                               uint8_t* xfer_buff, uint16_t xfer_len, bool dma, uint32_t dma_addr)
{
    debug_fn();
    if (ep_is_in)
    {
        if (xfer_len == 0)
        {
            Xfer_in_pkt_start(ep_num);
            Xfer_in_pkt_size(ep_num, 1);
        }
        else
        {
            Xfer_in_pkt_start(ep_num);
            if (xfer_len > ep_maxpacket)
                xfer_len = ep_maxpacket;
            Xfer_in_pkt_size(ep_num, 1);
            Xfer_in_pkt_end(ep_num, xfer_len);
        }
        if (dma)
            Xfer_in_enable_DMA(ep_num, dma_addr);
        else if (xfer_len > 0)
            set_dev_empty_mask(ep_num);
        Xfer_in_ep_enable(ep_num);
    }
    else
    {
        Xfer_out_pkt_start(ep_num);
        if (xfer_len > 0)
            xfer_len = ep_maxpacket;

        Xfer_out_pkt_size(ep_num, 1);
        Xfer_out_pkt_end(ep_num, ep_maxpacket);
        if (dma)
            Xfer_out_enable_DMA(ep_num, reinterpret_cast<uint32_t>(xfer_buff));
        Xfer_out_ep_enable(ep_num);
    }
}

