andreili/STM32FX_FM/src/stm32_hcd.cpp
void STM32_HCD::write_packet(uint8_t* src, uint8_t ch_ep_num, uint32_t len, uint8_t dma)
{
    debug_fn();
    if (!dma)
    {
        uint32_t count32b = (len + 3) >> 2;
        for (uint32_t i=0 ; i<count32b ; ++i, src+=4)
            //write_FIFO(ch_ep_num, *((__attribute__((__packed__))uint32_t *)src));
            write_FIFO(ch_ep_num, *reinterpret_cast<uint32_t*>(src));
    }
}

void* STM32_HCD::read_packet(uint8_t* dest, uint32_t len)
{
    debug_fn();
    uint32_t count32b = (len + 3) >> 2;
    for (uint32_t i=0 ; i<count32b ; ++i, dest+=4)
        //*((__attribute__((__packed__))uint32_t *)dest) = read_FIFO(0);
        *reinterpret_cast<uint32_t*>(dest) = read_FIFO(0);
    return reinterpret_cast<void*>(dest);
}

void STM32_HCD::EP_set_stall(bool ep_is_in, uint8_t ep_num)
{
    debug_fn();
    if (ep_is_in)
    {
        if (!is_in_endpoint_enable(ep_num))
            undisable_ep_in(ep_num);
        ep_in_set_stall(ep_num);
    }
    else
    {
        if (!is_out_endpoint_enable(ep_num))
            undisable_ep_out(ep_num);
        ep_out_set_stall(ep_num);
    }
}

void STM32_HCD::EP_clear_stall(bool ep_is_in, uint8_t ep_num, EEPType ep_type)
{
    debug_fn();
    if (ep_is_in)
    {
        ep_in_clear_stall(ep_num);
        if ((ep_type == EEPType::INTR) || (ep_type == EEPType::BULK))
            Xfer_in_set_data0_pid(ep_num);
    }
    else
    {
        ep_out_clear_stall(ep_num);
        if ((ep_type == EEPType::INTR) || (ep_type == EEPType::BULK))
            Xfer_out_set_data0_pid(ep_num);
    }
}

void STM32_HCD::set_dev_address(uint8_t address)
{
    debug_fn();
    clear_dev_address();
    set_dev_addr_RAW(address);
}

void STM32_HCD::stop_device()
{
    debug_fn();
    for (uint8_t i=0 ; i<15 ; ++i)
    {
        clear_in_ep_intr(i, 0xff);
        clear_out_ep_intr(i, 0xff);
    }
    //clear_shared_IT();
    clear_all_ITs();
    flush_RX_FIFO();
    flush_TX_FIFO(0x10);
}

void STM32_HCD::activate_setup()
{
    debug_fn();
    reset_max_pkt_size();
    if (get_dev_speed_RAW() == DSTS_ENUMSPD_LS_PHY_6MHZ)
        set_in_max_pkt_size(3);
    clear_in_global_NAK();
}

void STM32_HCD::EP0_out_start(uint8_t dma, uint8_t* psetup)
{
    debug_fn();
    out_endpoint_reset_Xfer_size(0);
    Xfer_out_pkt_size(0, 1);
    Xfer_out_pkt_end(0, 3*8);
    ep_out_setup_packet_count();
    if (dma)
    {
        Xfer_out_enable_DMA(0, reinterpret_cast<uint32_t>(psetup));
        ep_out_start_enable();
    }
}

uint32_t STM32_HCD::core_reset()
{
    debug_fn();
    uint32_t count = 0;
    do
    {
        if (++count > 200*1000)
            return STM32_RESULT_TIMEOUT;
    } while (!is_master_idle());
    core_soft_reset();
    count = 0;
    do
    {
        if (++count > 200*1000)
            return STM32_RESULT_TIMEOUT;
    } while (!is_core_reseted());
    return STM32_RESULT_OK;
}

void STM32_HCD::host_init()
{
    debug_fn();
    restart_phy_clock();
    /* Activate VBUS Sensing B */
    disable_VBUS_A();
    disable_VBUS_B();
    enable_VBUS();

    /* Disable the FS/LS support mode only */
    if ((m_speed == EOTGSpeed::FULL) && (m_regs != reinterpret_cast<OTGRegs_t*>(USB_OTG_FS)))
        enable_FS_LS_only();
    else
        disable_FS_LS_only();
    flush_TX_FIFO(0x10);
    flush_RX_FIFO();
    for (uint8_t i=0 ; i<m_host_channels ; ++i)
    {
        clear_HC_int(i, 0xffffffff);
        mask_all_HC_int(i);
    }
    drive_VBUS(SET);
    STM32_SYSTICK::delay(200);
    disable_all_IT();
    clear_all_IT1();
    if (m_regs == reinterpret_cast<OTGRegs_t*>(USB_OTG_FS))
    {
        set_RX_FIFO_size(0x80);
        set_RX_EP0_FIFO_size(0x60, 0x80);
        set_TX_FIFO_size(0x40, 0xe0);
    }
    else
    {
        set_RX_FIFO_size(0x200);
        set_RX_EP0_FIFO_size(0x100, 0x200);
        set_TX_FIFO_size(0xe0, 0x300);
    }
    if (!m_dma_enable)
        unmask_IT(USB_OTG_GINTMSK_RXFLVLM);
    unmask_IT(USB_OTG_GINTMSK_PRTIM            | USB_OTG_GINTMSK_HCIM |
              USB_OTG_GINTMSK_SOFM             |USB_OTG_GINTSTS_DISCINT|
              USB_OTG_GINTMSK_PXFRM_IISOOXFRM  | USB_OTG_GINTMSK_WUIM);
}

void STM32_HCD::init_FSLSPClk_sel(EClockSpeed freq)
{
    debug_fn();
    disable_FS_LS_clock_sel();
    enable_FS_LS_clock_sel();
    switch (freq)
    {
    case EClockSpeed::_30_60_MHZ:
        break;
    case EClockSpeed::_48_MHZ:
        set_FSLSPClk(48*1000);
        break;
    case EClockSpeed::_6_MHZ:
        set_FSLSPClk(6*1000);
        break;
    }
}

//#pragma GCC optimize ("O0")
void STM32_HCD::HC_start_Xfer(OTG_HC_t* hc, bool dma)
{
    debug_fn();
    if ((m_regs != reinterpret_cast<OTGRegs_t*>(USB_OTG_FS)) && (hc->speed == EOTGSpeed::HIGH))
    {
        if ((!dma) && hc->do_ping)
        {
            do_ping(hc->ch_num);
            return;
        }
        else if (dma)
        {
            mask_HC_int(hc->ch_num, USB_OTG_HCINTMSK_NYET | USB_OTG_HCINTMSK_ACKM);
            hc->do_ping = false;
        }
    }

    uint16_t numpackets;
    if (hc->xfer_len > 0)
    {
        numpackets = static_cast<uint16_t>((hc->xfer_len + hc->max_packet - 1) / hc->max_packet);
        if (numpackets > 256)
        {
            numpackets = 256;
            hc->xfer_len = numpackets * hc->max_packet;
        }
    }
    else
        numpackets = 1;

    if (hc->ep_is_in)
        hc->xfer_len = numpackets * hc->max_packet;

    HC_set_Xfer_size(hc->ch_num, hc->xfer_len, numpackets, static_cast<uint8_t>(hc->data_pid));

    if (dma)
        HC_set_Xfer_DMA(hc->ch_num, hc->xfer_buff);

    uint32_t is_odd = is_cur_frame_odd();
    disable_HC_odd_frame(hc->ch_num);
    set_HC_odd_frame(hc->ch_num, (is_odd << USB_OTG_HCCHAR_ODDFRM_Pos));

    HC_reactivate(hc->ch_num);

    if (!dma)
    {
        if ((!hc->ep_is_in) && (hc->xfer_len > 0))
        {
            switch (hc->ep_type)
            {
            case EEPType::CTRL:
            case EEPType::BULK:
                {
                    uint16_t len_w = static_cast<uint16_t>((hc->xfer_len + 3) / 4);
                    if (len_w > get_TX_NP_FIFO_size())
                        /* need to process data in nptxfempty interrupt */
                        unmask_IT(USB_OTG_GINTMSK_NPTXFEM);
                }
                break;
            case EEPType::INTR:
            case EEPType::ISOC:
                {
                    uint16_t len_w = static_cast<uint16_t>((hc->xfer_len + 3) / 4);
                    if (len_w > get_TX_P_FIFO_size())
                        /* need to process data in nptxfempty interrupt */
                        unmask_IT(USB_OTG_GINTMSK_PTXFEM);
                }
                break;
            case EEPType::MSK:
                break;
            }
            write_packet(hc->xfer_buff, hc->ch_num, hc->xfer_len, false);
        }
    }
}

