andreili/STM32FX_FM/src/stm32_hcd.cpp
void STM32_HCD::drive_VBUS(uint8_t state)
{
    debug_fn();
    __IO uint32_t val = m_regs->ports[0];
    val &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);
    if (((val & USB_OTG_HPRT_PPWR) == 0) && (state == 1))
        reset_port_st1(USB_OTG_HPRT_PPWR | val);
    if (((val & USB_OTG_HPRT_PPWR) == USB_OTG_HPRT_PPWR) && (state == 0))
        reset_port_st1((~USB_OTG_HPRT_PPWR) & val);
}

void STM32_HCD::do_ping(uint8_t ch_num)
{
    debug_fn();
    do_ping_LL(ch_num);
    HC_reactivate(ch_num);
}

void STM32_HCD::stop_host()
{
    debug_fn();
    disable_global_int();
    flush_TX_FIFO(0x10);
    flush_RX_FIFO();
    /* Flush out any leftover queued requests. */
    for(uint8_t i=0 ; i<15 ; ++i)
    {
        uint32_t tmp = HC_get_params(i);
        tmp |= USB_OTG_HCCHAR_CHDIS;
        tmp &= ~(USB_OTG_HCCHAR_CHENA | USB_OTG_HCCHAR_EPDIR);
        HC_set_param_RAW(i, tmp);
    }
    /* Halt all channels to put them into a known state. */
    for(uint8_t i=0 ; i<15 ; ++i)
    {
        uint32_t tmp = HC_get_params(i);
        tmp |= USB_OTG_HCCHAR_CHDIS;
        tmp &= ~(USB_OTG_HCCHAR_CHENA | USB_OTG_HCCHAR_EPDIR);
        HC_set_param_RAW(i, tmp);
        tmp = 0;
        do
        {
            if (++tmp > 1000)
                break;
        } while ((HC_get_params(i) & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
    }
    /* Clear any pending Host interrupts */
    set_host_IT(0xffffffff);
    clear_all_IT1();
    enable_global_int();
}

void STM32_HCD::HC_in_IRQ_handler(uint8_t chnum)
{
    debug_fn();
    uint32_t int_val = get_HC_int(chnum);
    uint32_t clear_mask = 0;
    bool unmask_halt = false;

    if (int_val & USB_OTG_HCINT_AHBERR)
    {
        clear_mask = USB_OTG_HCINT_AHBERR;
        //clear_HC_int(chnum, USB_OTG_HCINT_AHBERR);
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
    }
    else if (int_val & USB_OTG_HCINT_ACK)
        clear_mask = USB_OTG_HCINT_ACK;
        //clear_HC_int(chnum, USB_OTG_HCINT_ACK);
    else if (int_val & USB_OTG_HCINT_STALL)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        m_HC[chnum].state = EHCState::STALL;
        clear_mask = USB_OTG_HCINT_NAK | USB_OTG_HCINT_STALL;
        //clear_HC_int(chnum, USB_OTG_HCINT_NAK | USB_OTG_HCINT_STALL);
        HC_halt(chnum);
    }
    else if (int_val & USB_OTG_HCINT_DTERR)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        clear_mask = USB_OTG_HCINT_NAK | USB_OTG_HCINT_DTERR;
        //clear_HC_int(chnum, USB_OTG_HCINT_NAK | USB_OTG_HCINT_DTERR);
        m_HC[chnum].state = EHCState::DATATGLERR;
    }
    else if (int_val & USB_OTG_HCINT_FRMOR)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        clear_mask = USB_OTG_HCINT_FRMOR;
        //clear_HC_int(chnum, USB_OTG_HCINT_FRMOR);
    }
    else if (int_val & USB_OTG_HCINT_XFRC)
    {
        if (m_dma_enable)
            m_HC[chnum].xfer_count = m_HC[chnum].xfer_len - (HC_get_Xfer_size(chnum) & USB_OTG_HCTSIZ_XFRSIZ);
        m_HC[chnum].state = EHCState::XFRC;
        m_HC[chnum].ErrCnt = 0;
        clear_mask = USB_OTG_HCINT_XFRC;
        //clear_HC_int(chnum, USB_OTG_HCINT_XFRC);
        if ((m_HC[chnum].ep_type == EEPType::CTRL) ||
            (m_HC[chnum].ep_type == EEPType::BULK))
        {
            unmask_halt = true;
            //unmask_halt_HC_int(chnum);
            HC_halt(chnum);
            clear_mask |= USB_OTG_HCINT_NAK;
            //clear_HC_int(chnum, USB_OTG_HCINT_NAK);
        }
        else if (m_HC[chnum].ep_type == EEPType::INTR)
        {
            set_HC_odd_frame(chnum, USB_OTG_HCCHAR_ODDFRM);
            m_HC[chnum].urb_state = EURBState::DONE;
            HC_notify_URB_change_callback(this, chnum, m_HC[chnum].urb_state);
        }
        m_HC[chnum].toggle_in ^= 1;
    }
    else if (int_val &  USB_OTG_HCINT_CHH)
    {
        mask_halt_HC_int(chnum);
        if (m_HC[chnum].state == EHCState::XFRC)
            m_HC[chnum].urb_state = EURBState::DONE;
        else if (m_HC[chnum].state == EHCState::STALL)
            m_HC[chnum].urb_state = EURBState::STALL;
        else if ((m_HC[chnum].state == EHCState::XACTERR) ||
                 (m_HC[chnum].state == EHCState::DATATGLERR))
        {
            if (m_HC[chnum].ErrCnt++ > 3)
            {
                m_HC[chnum].ErrCnt = 0;
                m_HC[chnum].urb_state = EURBState::ERROR;
            }
            else
                m_HC[chnum].urb_state = EURBState::NOT_READY;
            HC_reactivate(chnum);
        }
        clear_mask = USB_OTG_HCINT_CHH;
        //clear_HC_int(chnum, USB_OTG_HCINT_CHH);
        HC_notify_URB_change_callback(this, chnum, m_HC[chnum].urb_state);
    }
    else if (int_val & USB_OTG_HCINT_TXERR)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        ++m_HC[chnum].ErrCnt;
        m_HC[chnum].state = EHCState::XACTERR;
        HC_halt(chnum);
        clear_mask = USB_OTG_HCINT_TXERR;
        //clear_HC_int(chnum, USB_OTG_HCINT_TXERR);
    }
    else if (int_val & USB_OTG_HCINT_NAK)
    {
        if (m_HC[chnum].ep_type == EEPType::INTR)
        {
            unmask_halt = true;
            //unmask_halt_HC_int(chnum);
            HC_halt(chnum);
        }
        m_HC[chnum].state = EHCState::NAK;
        clear_mask = USB_OTG_HCINT_NAK;
        //clear_HC_int(chnum, USB_OTG_HCINT_NAK);
        if ((m_HC[chnum].ep_type == EEPType::CTRL) ||
            (m_HC[chnum].ep_type == EEPType::BULK))
            HC_reactivate(chnum);
    }
    clear_HC_int(chnum, clear_mask);
    if (unmask_halt)
        unmask_halt_HC_int(chnum);
}

void STM32_HCD::HC_out_IRQ_handler(uint8_t chnum)
{
    debug_fn();
    uint32_t int_val = get_HC_int(chnum);
    uint32_t clear_mask = 0;
    bool unmask_halt = false;

    if (int_val & USB_OTG_HCINT_AHBERR)
    {
        clear_mask = USB_OTG_HCINT_AHBERR;
        //clear_HC_int(chnum, USB_OTG_HCINT_AHBERR);
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
    }
    else if (int_val & USB_OTG_HCINT_ACK)
    {
        clear_mask = USB_OTG_HCINT_ACK;
        //clear_HC_int(chnum, USB_OTG_HCINT_ACK);
        if (m_HC[chnum].do_ping)
        {
            m_HC[chnum].state = EHCState::NYET;
            unmask_halt = true;
            //unmask_halt_HC_int(chnum);
            HC_halt(chnum);
            m_HC[chnum].urb_state = EURBState::NOT_READY;
        }
    }
    else if (int_val & USB_OTG_HCINT_NYET)
    {
        m_HC[chnum].state = EHCState::NYET;
        m_HC[chnum].ErrCnt = 0;
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        clear_mask = USB_OTG_HCINT_NYET;
        //clear_HC_int(chnum, USB_OTG_HCINT_NYET);
    }
    else if (int_val & USB_OTG_HCINT_FRMOR)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        clear_mask = USB_OTG_HCINT_FRMOR;
        //clear_HC_int(chnum, USB_OTG_HCINT_FRMOR);
    }
    else if (int_val & USB_OTG_HCINT_XFRC)
    {
        m_HC[chnum].ErrCnt = 0;
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        clear_mask = USB_OTG_HCINT_XFRC;
        //clear_HC_int(chnum, USB_OTG_HCINT_XFRC);
        m_HC[chnum].state = EHCState::XFRC;
    }
    else if (int_val & USB_OTG_HCINT_STALL)
    {
        clear_mask = USB_OTG_HCINT_STALL;
        //clear_HC_int(chnum, USB_OTG_HCINT_STALL);
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        m_HC[chnum].state = EHCState::STALL;
    }
    else if (int_val & USB_OTG_HCINT_NAK)
    {
        m_HC[chnum].ErrCnt = 0;
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        m_HC[chnum].state = EHCState::NAK;
        clear_mask = USB_OTG_HCINT_NAK;
        //clear_HC_int(chnum, USB_OTG_HCINT_NAK);
    }
    else if (int_val & USB_OTG_HCINT_TXERR)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        m_HC[chnum].state = EHCState::XACTERR;
        clear_mask = USB_OTG_HCINT_TXERR;
        //clear_HC_int(chnum, USB_OTG_HCINT_TXERR);
    }
    else if (int_val & USB_OTG_HCINT_DTERR)
    {
        unmask_halt = true;
        //unmask_halt_HC_int(chnum);
        HC_halt(chnum);
        m_HC[chnum].state = EHCState::DATATGLERR;
        clear_mask = USB_OTG_HCINT_DTERR | USB_OTG_HCINT_NAK;
        //clear_HC_int(chnum, USB_OTG_HCINT_DTERR | USB_OTG_HCINT_NAK);
    }
    else if (int_val & USB_OTG_HCINT_CHH)
    {
        mask_halt_HC_int(chnum);
        switch (m_HC[chnum].state)
        {
        case EHCState::XFRC:
            m_HC[chnum].urb_state = EURBState::DONE;
            if (m_HC[chnum].ep_type == EEPType::BULK)
                m_HC[chnum].toggle_out ^= 1;
            break;
        case EHCState::NAK:
            m_HC[chnum].urb_state = EURBState::NOT_READY;
            break;
        case EHCState::NYET:
            m_HC[chnum].urb_state = EURBState::NOT_READY;
            m_HC[chnum].do_ping = false;
            break;
        case EHCState::STALL:
            m_HC[chnum].urb_state = EURBState::STALL;
            break;
        case EHCState::XACTERR:
        case EHCState::DATATGLERR:
            if (m_HC[chnum].ErrCnt++ > 3)
            {
                m_HC[chnum].ErrCnt = 0;
                m_HC[chnum].urb_state = EURBState::ERROR;
            }
            else
                m_HC[chnum].urb_state = EURBState::NOT_READY;
            break;
        case EHCState::IDLE:
        case EHCState::HALTED:
        case EHCState::BBLERR:
            break;
        }

