andreili/STM32FX_FM/src/stm32_hcd.cpp
        clear_mask = USB_OTG_HCINT_CHH;
        //clear_HC_int(chnum, USB_OTG_HCINT_CHH);
        HC_notify_URB_change_callback(this, chnum, m_HC[chnum].urb_state);
    }

    clear_HC_int(chnum, clear_mask);
    if (unmask_halt)
        unmask_halt_HC_int(chnum);
}

void STM32_HCD::RXQLVL_IRQ_handler()
{
    debug_fn();
    uint32_t tmp = m_regs->global.GRXSTSP;
    uint8_t ch_num = tmp & USB_OTG_GRXSTSP_EPNUM;
    uint32_t pktsts = (tmp & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos;
    uint32_t pktcnt = (tmp & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos;

    switch (pktsts)
    {
    case GRXSTS_PKTSTS_IN:
        if ((pktcnt > 0) && (m_HC[ch_num].xfer_buff != nullptr))
        {
            read_packet(m_HC[ch_num].xfer_buff, pktcnt);
            m_HC[ch_num].xfer_buff += pktcnt;
            m_HC[ch_num].xfer_count += pktcnt;
            if ((HC_get_Xfer_size(ch_num) & USB_OTG_HCTSIZ_PKTCNT) > 0)
            {
                HC_reactivate(ch_num);
                m_HC[ch_num].toggle_in ^= 1;
            }
        }
        break;
    case GRXSTS_PKTSTS_DATA_TOGGLE_ERR:
    case GRXSTS_PKTSTS_IN_XFER_COMP:
    case GRXSTS_PKTSTS_CH_HALTED:
    default:
        break;
    }
}

void STM32_HCD::port_IRQ_handler()
{
    debug_fn();
    uint32_t hprt0, hprt0_dup;
    hprt0 = hprt0_dup = m_regs->ports[0];

    hprt0_dup &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET |
                   USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);
    if ((hprt0 & USB_OTG_HPRT_PCDET) == USB_OTG_HPRT_PCDET)
    {
        if ((hprt0 & USB_OTG_HPRT_PCSTS) == USB_OTG_HPRT_PCSTS)
        {
            mask_IT(USB_OTG_GINTSTS_DISCINT);
            connect_callback(this);
        }
        hprt0_dup |= USB_OTG_HPRT_PCDET;
    }
    if ((hprt0 & USB_OTG_HPRT_PENCHNG) == USB_OTG_HPRT_PENCHNG)
    {
        hprt0_dup |= USB_OTG_HPRT_PENCHNG;
        if ((hprt0 & USB_OTG_HPRT_PENA) == USB_OTG_HPRT_PENA)
        {
            if (m_phy == EOTG_PHY::EMBEDDED)
            {
                if ((hprt0 & USB_OTG_HPRT_PSPD) == USB_OTG_HPRT_PSPD)
                    init_FSLSPClk_sel(EClockSpeed::_6_MHZ);
                else
                    init_FSLSPClk_sel(EClockSpeed::_48_MHZ);
            }
            else if (m_speed == EOTGSpeed::FULL)
                set_FSLSPClk(60*1000);
            connect_callback(this);
        }
        else
        {
            m_regs->ports[0] &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);
            unmask_IT(USB_OTG_GINTSTS_DISCINT);
        }
    }

    if ((hprt0 & USB_OTG_HPRT_POCCHNG) == USB_OTG_HPRT_POCCHNG)
        hprt0_dup |= USB_OTG_HPRT_POCCHNG;
    reset_port_st1(hprt0_dup);
}

#ifdef STM32_USE_USB_FS
STM32_HCD usb_fs;
#endif

//#ifdef STM32_USE_USB_HS
STM32_HCD usb_hs;
//#endif

#ifdef STM32_USE_USB_FS
void ISR::OTG_FS_IRQ()
{
    usb_fs.IRQ_handler();
}
#endif

#ifdef STM32_USE_USB_HS
void ISR::OTG_HS_IRQ()
{
    usb_hs.IRQ_handler();
}
#endif

__attribute__((weak)) void disconnect_callback(STM32_HCD *hcd)
{
    UNUSED(hcd);
}

__attribute__((weak)) void connect_callback(STM32_HCD *hcd)
{
    UNUSED(hcd);
}

__attribute__((weak)) void SOF_callback(STM32_HCD *hcd)
{
    UNUSED(hcd);
}

__attribute__((weak)) void HC_notify_URB_change_callback(STM32_HCD *hcd, uint8_t ch_num, STM32_HCD::EURBState urb_state)
{
    UNUSED(hcd);
    UNUSED(ch_num);
    UNUSED(urb_state);
}

#endif //STM32_USE_USB_HOST
